Revit 2026 API

# SketchEditScope Methods

---

The SketchEditScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Cancels the edit scope. (Inherited from EditScope) |
|  | Commit | Finishes the edit scope. (Inherited from EditScope) |
|  | Dispose | (Inherited from EditScope) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsElementWithoutSketch | Validates if an element can have a sketch but currently does not. |
|  | IsSketchEditingSupported | Checks whether sketch can be edited. |
|  | IsSketchEditingSupportedForSketchBasedElement | Checks whether the element supports sketch editing. |
|  | Start | Starts a sketch edit mode. |
|  | StartWithNewSketch | Starts a sketch edit mode for an element which, at this moment, doesn't have a sketch. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SketchEditScope Class

Autodesk.Revit.DB Namespace